Document Property
 Returns the Document in which the Element resides.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public Document Document { get; }
  Visual Basic
Public ReadOnly Property Document As Document
	Get
  Visual C++
public:
property Document^ Document {
	Document^ get ();
}
 Remarks
 All elements are contained within a document. An element can be retrieved from this document by using the id that is returned by the element's id property.
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →